Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: Configuring the Native Executable
pt_br: Configuração do executável nativo

source: Configuring the Pulsar broker
pt_br: Configurar o broker Pulsar

source: Configuring the cluster
pt_br: Configurando o cluster

source: Configuring the image
pt_br: Configurando a imagem

source: Configuring the transaction timeout
pt_br: Configurando o tempo limite da transação

source: Configuring transaction node name identifier
pt_br: Configurando o identificador de nome do nó de transação

source: Configuring your datasources
pt_br: Configurando suas fontes de dados

source: Configuring your project
pt_br: Configurando seu projeto

source: Connect with us on social media
pt_br: Conecte-se conosco nas redes sociais

source: Cons
pt_br: Contras

source: Consume Configuration from Consul
pt_br: Consumindo configuração do Consul

source: Consume Configuration from Google Cloud Secret Manager
pt_br: Consumindo configuração do Google Cloud Secret Manager

source: Consumer name
pt_br: Nome do consumidor

source: Consumer should take action when it receives a message that can not be decrypted. + * **FAIL**: this is the default option to fail messages until crypto succeeds. + * **DISCARD**:silently acknowledge and not deliver message to an application. + * **CONSUME**: deliver encrypted messages to applications. It is the application's responsibility to decrypt the message. The decompression of message fails. If messages contain batch messages, a client is not be able to retrieve individual messages in batch. Delivered encrypted message contains `EncryptionContext` which contains encryption and compression information in it using which application can decrypt consumed message payload.
pt_br: O consumidor deve agir quando receber uma mensagem que não pode ser descriptografada. + * **FAIL**: esta é a opção padrão para falhar mensagens até que a criptografia seja bem-sucedida. + * **DESCARTAR**:reconhecer silenciosamente e não entregar mensagem a um aplicativo. + * **CONSUME**: entregar mensagens criptografadas para aplicativos. É responsabilidade do aplicativo descriptografar a mensagem. A descompactação da mensagem falha. Se as mensagens contiverem mensagens em lote, um cliente não poderá recuperar mensagens individuais em lote. A mensagem criptografada entregue contém 'EncryptionContext' que contém informações de criptografia e compactação usando qual aplicativo pode descriptografar a carga útil da mensagem consumida.

source: Consuming GraphQL Services
pt_br: Consumindo serviços GraphQL

source: Consuming Kubernetes ConfigMaps
pt_br: Consumindo o Kubernetes ConfigMaps

source: Consuming gRPC Services
pt_br: Consumindo serviços gRPC

source: Container First
pt_br: Contêiner em primeiro lugar

source: Containerize native applications using virtual threads
pt_br: Conteinerização de aplicações nativas usando threads virtuais

source: Context Propagation
pt_br: Propagação de contexto

source: Continuous Testing
pt_br: Testes contínuos

source: Contributing
pt_br: Contribuindo

source: Contributing to Dev UI
pt_br: Contribuindo para a interface do usuário do desenvolvedor

source: Contributing to the Quarkus.io website
pt_br: Contribuindo para o website Quarkus.io

source: Contributions are welcome, please submit pull requests for the `develop` branch.
pt_br: Contribuições são bem-vindas, por favor, envie pull-requests para a branch `develop`.

source: Core
pt_br: Núcleo

source: Create a microservice using your favorite Spring API.
pt_br: Crie um microsserviço usando sua API favorita do Spring.

source: Create a native executable using:
pt_br: Criar um executável nativo utilizando:

source: Create a portable Java API to write serverless functions deployable to AWS Lambda, Azure Functions, Knative, and more.
pt_br: Crie uma API Java portátil para escrever funções sem servidor implantáveis no AWS Lambda, Azure Functions, Knative e muito mais.

source: Create a working branch for your project by using your version control system.
pt_br: Crie uma `branch` para o seu projeto utilizando o seu sistema de controle de versão.

source: Create and debug applications in the same environment where applications run. Live coding in development mode where any changes made locally will be immediately visible in a clustered Kubernetes environment. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Read this blog post for greater insight.</a>
pt_br: Crie e depure aplicativos no mesmo ambiente em que as aplicações são executadas. Codificação ao vivo no modo de desenvolvimento, onde quaisquer alterações feitas localmente serão imediatamente visíveis em um ambiente Kubernetes em cluster. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Leia esta postagem do blog para obter mais informações.</a>

source: Create projects, manage extensions, and execute essential build and dev commands.
pt_br: Crie projetos, gerencie extensões e execute comandos essenciais de compilação e desenvolvimento.

source: Create the Quarkus AWS Lambda Maven project using our Maven Archetype.
pt_br: Crie o projeto Quarkus AWS Lambda Maven utilizando o nosso Arquétipo Maven.

source: Create the `src/main/java/org/acme/redis/IncrementResource.java` file, with the following content:
pt_br: Criar o arquivo `src/main/java/org/acme/redis/IncrementResource.java`, com o seguinte conteúdo:

source: Create the `src/main/java/org/acme/redis/IncrementService.java` file, with the following content:
pt_br: Criar o arquivo `src/main/java/org/acme/redis/IncrementService.java`, com o seguinte conteúdo:

source: Create the `src/test/java/org/acme/redis/IncrementResourceTest.java` file with the following content:
pt_br: Crie o arquivo `src/test/java/org/acme/redis/IncrementoResourceTest.java` com o seguinte conteúdo:

source: Creating a Linux executable without GraalVM installed
pt_br: Criando um executável Linux sem o GraalVM instalado

source: Creating a container
pt_br: Criando um contêiner

source: Creating a new increment
pt_br: Criando um novo incremento

source: Creating the Increment POJO
pt_br: Criando o POJO Incremento

source: Creating the Increment Resource
pt_br: Criando o recurso de incremento `IncrementoResource`

source: Creating the Increment Service
pt_br: Criando o Serviço de Incremento `IncrementoService`

source: Creating the Maven Deployment Project
pt_br: Criando o Maven Deployment Project

source: Creating the Maven Project
pt_br: Criando o projeto Maven

source: Creating the test class
pt_br: Criando a classe de teste

source: Credentials Provider
pt_br: Provedor de credenciais

source: Cross Site Request Forgery (CSRF) prevention
pt_br: Prevenção de falsificação de solicitação entre sites (CSRF)

source: Custom Lambda
pt_br: Lambda personalizado

source: Custom Security Integration
pt_br: Integração de segurança personalizada

source: Customize Quarkus' security layer behavior.
pt_br: Personalize o comportamento da camada de segurança do Quarkus.

source: Data
pt_br: Dados

source: Database Dev Services
pt_br: Dev Services de banco de dados

source: Dead letter policy for consumers. By default, some messages are probably redelivered many times, even to the extent that it never stops. By using the dead letter mechanism, messages have the max redelivery count. **When exceeding the maximum number of redeliveries, messages are sent to the Dead Letter Topic and acknowledged automatically**. You can enable the dead letter mechanism by setting `deadLetterPolicy`. When specifying the dead letter policy while not specifying `ackTimeoutMillis`, you can set the ack timeout to 30000 millisecond.
pt_br: Política de dead letter para os consumidores. Por padrão, algumas mensagens provavelmente são reentregues muitas vezes, até mesmo na medida em que nunca param. Usando o mecanismo de dead letter, as mensagens têm a contagem máxima de reentrega. **Ao exceder o número máximo de reentregas, as mensagens são enviadas para o Tópico de Dead Letter e reconhecidas automaticamente**. Você pode ativar o mecanismo de letra morta definindo 'deadLetterPolicy'. Ao especificar a política de dead letter enquanto não especifica 'ackTimeoutMillis', você pode definir o tempo limite de ack para 30000 milissegundos.

source: Debugging native executable
pt_br: Debugando um executável nativo

source: December 6, 2019
pt_br: 6 de dezembro de 2019

source: Declarative approach
pt_br: Abordagem declarativa

source: Default
pt_br: Padrão

source: Default delay for reconsume failure-strategy, in seconds
pt_br: Atraso padrão para estratégia de falha de reconsumo, em segundos

source: Delay to wait before redelivering messages that failed to be processed. + When an application uses `Consumer#negativeAcknowledge(Message)`, failed messages are redelivered after a fixed timeout.
pt_br: Atraso para aguardar antes de entregar novamente as mensagens que não puderam ser processadas. + Quando um aplicativo usa 'Consumer#negativeAcknowledge(Message)', as mensagens com falha são entregues novamente após um tempo limite fixo.

source: Delete a key (and its associated value)
pt_br: Exclui uma chave (e o respetivo valor associado)

source: Delete the `first` increment.
pt_br: Excluir o incremento `first`.

source: Deleting a key
pt_br: Excluindo uma chave

source: Depending on what the final desired output of the CI/CD pipeline is, the generated binary might then be used to create a container image.
pt_br: Dependendo do resultado final desejado do pipeline CI/CD, o binário gerado pode então ser utilizado para criar uma imagem de contêiner.

source: Deploy to AWS
pt_br: Deploy na AWS

source: Deploy your Quarkus applications on Heroku.
pt_br: Implante seus aplicativos Quarkus na Heroku.

source: Deploying Quarkus Applications on Kubernetes
pt_br: Implantando Aplicações Quarkus no Kubernetes

source: Deploying Quarkus Applications on OpenShift
pt_br: Implantando Aplicações Quarkus no OpenShift

source: Deploying a native executable
pt_br: Deploy de um executável nativo

source: Deploying to Google Cloud
pt_br: Implantação no Google Cloud

source: Deploying to Heroku
pt_br: Implantando na Heroku

source: Deploying to Microsoft Azure Cloud
pt_br: Implantando na nuvem do Microsoft Azure

source: Description
pt_br: Descrição

source: Detect pinned thread in tests
pt_br: Detectar thread fixada em testes

source: Dev Mode Differences
pt_br: Diferenças no modo de desenvolvimento

source: Dev Services
pt_br: Serviços de Desenvolvimento

source: Dev Services for AMQP
pt_br: Dev Services para AMQP

source: Dev Services for AMQP is automatically enabled unless:
pt_br: O Dev Services para AMQP é ativado automaticamente, a menos que:

source: Dev Services for AMQP starts the container with the `quarkus-dev-service-amqp` label which is used to identify the container.
pt_br: Dev Services para AMQP inicia o container com a etiqueta `quarkus-dev-service-amqp` que é utilizada para identificar o container.

source: Dev Services for Kafka
pt_br: Dev Services para o Kafka

source: Dev Services for Kafka is automatically enabled unless:
pt_br: Os Dev Services para o Kafka é ativado automaticamente, a menos que:

source: Dev Services for Kafka starts the container with the `quarkus-dev-service-kafka` label which is used to identify the container.
pt_br: O Dev Services para o Kafka inicia o broker com a etiqueta `quarkus-dev-service-kafka` que é utilizada para identificar o container.

source: Dev Services for Kubernetes
pt_br: Dev Services para Kubernetes

source: Dev Services for Kubernetes is automatically enabled unless:
pt_br: O Dev Services para Kubernetes é ativado automaticamente, a menos que:

source: Dev Services for Kubernetes starts the container with the `quarkus-dev-service-kubernetes` label which is used to identify the container.
pt_br: O Dev Services para Kubernetes inicia o container com a etiqueta `quarkus-dev-service-kubernetes` que é utilizada para identificar o container.

source: Dev Services for Pulsar
pt_br: Dev Services para Pulsar

source: Dev Services for Pulsar is automatically enabled unless:
pt_br: Os Dev services para Pulsar são ativados automaticamente, a menos que:

source: Dev Services for Pulsar starts the container with the `quarkus-dev-service-pulsar` label which is used to identify the container.
pt_br: O Dev Services para Pulsar inicia o contêiner com a etiqueta `quarkus-dev-service-pulsar` que é utilizada para identificar o contêiner.

source: Dev Services for Pulsar supports the https://hub.docker.com/r/apachepulsar/pulsar[official Apache Pulsar image].
pt_br: O Dev Services para Pulsar suporta a link:https://hub.docker.com/r/apachepulsar/pulsar[imagem oficial do Apache Pulsar].

source: Dev UI
pt_br: Interface do usuário do desenvolvedor

source: Developer Joy
pt_br: Alegria em desenvolver

source: Developers are critical to the success of almost every organization and they need the tools to build cloud-native applications quickly and efficiently. Quarkus provides a frictionless development experience through a combination of tools, libraries, extensions, and more. Quarkus makes developers more efficient with tools to improve the inner loop development cycle while in dev mode.
pt_br: Os desenvolvedores são fundamentais para o sucesso de quase todas as organizações e precisam das ferramentas para criar aplicativos nativos da nuvem de forma rápida e eficiente. O Quarkus fornece uma experiência de desenvolvimento sem atrito por meio de uma combinação de ferramentas, bibliotecas, extensões e muito mais. O Quarkus torna os desenvolvedores mais eficientes com ferramentas para melhorar o ciclo de desenvolvimento de loop interno enquanto estiver no modo de desenvolvimento.

source: Developing REST Services with RESTEasy Classic
pt_br: Desenvolvimento de serviços REST com o RESTEasy Classic

source: Differences between virtual threads and platform threads
pt_br: Diferenças entre threads virtuais e threads de plataforma

source: Disable preloading
pt_br: Desativar o pré-carregamento

source: Discover how to create your first Quarkus application.
pt_br: Descubra como criar sua primeira aplicação Quarkus.

source: Discover how to develop highly scalable REST services with JAX-RS and RESTEasy Reactive.
pt_br: Descubra como desenvolver serviços REST altamente escaláveis com JAX-RS e RESTEasy Reactive.

source: Discover how you can streamline the release process of your Quarkus applications with JReleaser.
pt_br: Descubra como você pode agilizar o processo de release de suas aplicações Quarkus com o JReleaser.

source: Discuss the development of Quarkus with the team in the <a href="mailto:quarkus-dev+subscribe@googlegroups.com">development mailing list </a> or by <a href="https://quarkusio.zulipchat.com/">Zulip Chat</a>.
pt_br: Discuta o desenvolvimento do Quarkus com a equipe na <a href="mailto:quarkus-dev+subscribe@googlegroups.com">lista de discussão de desenvolvimento </a> ou pelo <a href="https://quarkusio.zulipchat.com/">Zulip Chat</a>.

source: Discussion about Quarkus
pt_br: Discussão sobre o Quarkus

source: Discussions and Collaboration
pt_br: Discussões e Colaboração

source: Distroless image support is experimental.
pt_br: O suporte de imagens sem distribuição é experimental.

source: Distroless images should not be used in production without rigorous testing.
pt_br: As imagens sem distribuição não devem ser utilizadas em produção sem um teste rigoroso.

source: Docker and Docker Compose or xref:podman.adoc[Podman], and Docker Compose
pt_br: Docker e Docker Compose ou xref:podman.adoc[Podman] e Docker Compose

source: Documentation
pt_br: Documentação

source: Does it do 2 Phase Commit and slow down my app?
pt_br: Fazer 2 Phase Commit e torna a minha aplicação mais lenta?

source: Does it work everywhere I want to?
pt_br: Funciona em todos os lugares que eu quiser?

source: Don't forget to use the `--enable-preview` flag if you are not using Java 21+.
pt_br: Não se esqueça de utilizar o parâmetro `--enable-preview` se não estiver utilizando Java 21+.

source: Download the appropriate archive from <https://github.com/graalvm/mandrel/releases> or <https://github.com/graalvm/graalvm-ce-builds/releases>, and unpack it like you would any other JDK.
pt_br: Download do arquivo apropriado de https://github.com/graalvm/mandrel/releases ou https://github.com/graalvm/graalvm-ce-builds/releases e descompacte-o como faria com qualquer outro JDK.

source: Duration of waiting for a connection to a broker to be established.If the duration passes without a response from a broker, the connection attempt is dropped.
pt_br: Duração da espera para que uma conexão com um broker seja estabelecida. Se a duração passar sem uma resposta de um broker, a tentativa de conexão será descartada.

source: During the startup and readiness health check, the connector connects to the broker and retrieves the list of topics. This attribute specifies the maximum duration (in ms) for the retrieval. If exceeded, the channel is considered not-ready. Type: _long_
pt_br: Durante a verificação de integridade de inicialização e preparação, o conector se conecta ao agente e recupera a lista de tópicos. Esse atributo especifica a duração máxima (em ms) para a recuperação. Se excedido, o canal é considerado não pronto. Tipo: _long_

source: Easy Quarkus-based scripting with jbang.
pt_br: Script fácil baseado em Quarkus com jbang.

source: Edit the `pom.xml` file to add the following dependency:
pt_br: Edite o arquivo `pom.xml` para adicionar a seguinte dependência:

source: Elasticsearch Clients
pt_br: Clientes Elasticsearch

source: Elasticsearch Dev Services
pt_br: Dev Services Elasticsearch

source: Enable Basic authentication
pt_br: Ativar a autenticação básica

source: Enable batching of messages.
pt_br: Habilite o envio em lote de mensagens.

source: Enable chunking of messages.
pt_br: Habilite o fragmento de mensagens.

source: Enable optimistic locking
pt_br: Ativar o bloqueio otimista (`Optimistic locking`)

source: Enable xref:security-basic-authentication.adoc[Basic authentication] for your Quarkus project and allow users to authenticate with a username and password.
pt_br: Ative link:security-basic-authentication.html[a autenticação básica] para o seu projeto Quarkus e permita que os usuários se autentiquem com um username e um password.

source: Enables (default) or disables the Cloud Event support. If enabled on an _incoming_ channel, the connector analyzes the incoming records and try to create Cloud Event metadata. If enabled on an _outgoing_, the connector sends the outgoing messages as Cloud Event if the message includes Cloud Event Metadata. Type: _boolean_
pt_br: Habilita (padrão) ou desabilita o suporte a Cloud Event. Se habilitado em um canal _incoming_, o conector analisará os registros de entrada e tentará criar metadados do Cloud Event. Se habilitado em um _outgoing_, o conector enviará as mensagens de saída como Cloud Event se a mensagem incluir Metadados de Evento de Nuvem. Tipo: _boolean_

source: Enables the in-container build
pt_br: Permite a compilação no contêiner

source: Enabling / Disabling Dev Services for AMQP
pt_br: Ativação/desativação do Dev Services para AMQP

source: Enabling / Disabling Dev Services for Kafka
pt_br: Ativar/desativar Dev Services para o Kafka

source: Enabling / Disabling Dev Services for Kubernetes
pt_br: Ativar/desativar Dev Services para Kubernetes

source: Enabling / Disabling Dev Services for Pulsar
pt_br: Ativando / Desativando Dev Services para o Pulsar

source: Enabling / Disabling SnapStart Optimizations
pt_br: Ativar / Desativar as otimizações do SnapStart

source: Ensure the project builds without errors, all tests pass, and the application functions as required before deploying to production.
pt_br: Garanta que o projeto é construído sem erros, que todos os testes são aprovados e que a aplicação funciona conforme esperado antes de ser implantado em produção.

source: Enterprise support provided by Red Hat for the product.
pt_br: Suporte corporativo fornecido pela Red Hat para o produto.

source: Entry point for everything gRPC.
pt_br: Ponto de entrada para tudo o que é gRPC.

source: Error 404
pt_br: Erro 404

source: Events
pt_br: Eventos

source: Every contribution is valuable. It can be a bug report, an example application, a feature request, a fix in the documentation or just feedback.
pt_br: Todas as contribuições são valiosas. Pode ser um relatório de bug, um exemplo de aplicação, uma melhoria, uma correção na documentação ou apenas um feedback.

source: Every developer has their favorite IDE. Learn how to use Quarkus in yours.
pt_br: Cada desenvolvedor tem seu IDE favorito. Saiba como usar o Quarkus no seu.

source: Examine sam.yaml
pt_br: Examinando o sam.yaml

source: Examine the POM
pt_br: Examinando o POM

source: Example of signature
pt_br: Exemplo de assinatura

source: Excluding tests when running as a native executable
pt_br: Excluindo testes ao executar como um executável nativo

source: Explore all the BuildItems you can consume/produce in your extensions.
pt_br: Explore todos os BuildItems que você pode consumir/produzir em suas extensões.

source: Explore in more details how to debug native executables.
pt_br: Explore com mais detalhes como depurar executáveis nativos.

source: Explore the Quarkus developer toolchain which makes Quarkus development so fast and enjoyable.
pt_br: Explore a cadeia de ferramentas para desenvolvedores do Quarkus, que torna o desenvolvimento do Quarkus tão rápido e agradável.

source: Explore the wide breadth of technologies Quarkus with which applications can be made.
pt_br: Explore a ampla gama de tecnologias Quarkus com as quais as aplicações podem ser feitas.

source: Extend and customize the Configuration.
pt_br: Estenda e personalize a Configuração.

source: Extending Configuration Support
pt_br: Estendendo o suporte à configuração

source: Extension metadata
pt_br: Metadados de extensão

source: Extensions have a various degree of maturity when they enter the Quarkus ecosystem. A status offers the expectations you can rely on.
pt_br: As extensões têm um grau de maturidade variado quando entram no ecossistema Quarkus. Um status oferece as expectativas nas quais você pode confiar.

source: Extra Build Generated Files
pt_br: Arquivos extras gerados pela compilação

source: Extracting Content with Apache Tika
pt_br: Extraindo conteúdo com o Apache Tika

source: Feedback and Help
pt_br: Feedback e ajuda

source: First declare your service as follows:
pt_br: Primeiro declare seu serviço da seguinte maneira:

source: First, we need a new project. Create a new project with the following command:
pt_br: Primeiro, precisamos de um novo projeto. Crie um novo projeto com o seguinte comando:

source: First, we will need to package it:
pt_br: Em primeiro lugar, temos que empacotar a aplicação:

source: First, you can consume messages from various brokers such as AMQP or Apache Kafka, and process these messages smoothly:
pt_br: Primeiro, você pode consumir mensagens de vários brokers, como AMQP ou Apache Kafka, e processar essas mensagens sem problemas:

source: First, you need to add the `quarkus-redis-cache` extension to your project:
pt_br: Em primeiro lugar, é necessário adicionar a extensão `quarkus-redis-cache` ao seu projeto:

source: First-Class Support for GraalVM Native Images
pt_br: Suporte de primeira classe para imagens nativas do GraalVM

source: Follow us and get updates delivered to your favorite social media channel.
pt_br: Siga-nos e receba atualizações em seu canal de mídia social favorito.

source: For Docker:
pt_br: Para o Docker:
